Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartDataBar
The bar data of part.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartDataBar.CoordSys
Gets or sets the coordinate system.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartDataBar.Profile
Gets or sets the bar profile.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartDataBar.Material
Gets or sets the bar material.